Autodesk.Revit.DB.Geolocation.AdvancedGeolocation.AddBaseVerticalCoordinateReferenceSystem(Autodesk.Revit.DB.Geolocation.CrsEncodingType,System.String)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Geolocation.AdvancedGeolocation.AddBaseCoordinateReferenceSystem(Autodesk.Revit.DB.Geolocation.CrsEncodingType,System.String)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Geolocation.AdvancedGeolocation
advanced